#include "global.h"
int errorNum;//错误数量
string errorinfo[100] = { "","非法的字符","非法的字符串","未知的单词","","","","","","","",
						"缺少;","缺少)","缺少:","缺少=","缺少:=","缺少]","缺少then","缺少while","缺少to/downto","缺少do",
						"缺少end","缺少.","缺少begin","非法的过程标识符","非法的参数","非法的参数类型","非法的函数标识符","非法的返回值类型","非法的标识符","非法的无符号整数",
						"非法的关系运算符","非法的类型","数组格式错误","非法的比较运算符","","","","","","",
						"未找到该标识符","重定义的标识符","","","","","","","",""
};
int error(int code)
{
	cout << "*******************************" << endl;
	cout << "第" << sLine << "行 error " << code << " : " << errorinfo[code] << endl;
	cout << "*******************************" << endl;
	errorNum++;
	exit(code);
	return code;
}